In [40]:
import pandas as pd
import numpy as np

In [41]:
df=pd.read_csv('Startups_Expense.csv')

In [42]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [43]:
# drop_first is used to solve dummy variable trap by droping one coloumn i.e using n-1 cols (california is droped)
# Basically what we can see is categorical data is converted to one hot vector on a top level


df1=pd.get_dummies(df['State'],drop_first=True)
df1.head()

   Florida  New York
0        0         1
1        0         0
2        1         0
3        0         1
4        1         0

In [44]:
# Categorical data of state is converted to one hot vector
df=pd.concat([df1,df],axis=1)
df.head()

,Florida,New York,R&D Spend,Administration,Marketing Spend,State,Profit
0,0,1,165349.20,136897.80,471784.10,New York,192261.83
1,0,0,162597.70,151377.59,443898.53,California,191792.06
2,1,0,153441.51,101145.55,407934.54,Florida,191050.39
3,0,1,144372.41,118671.85,383199.62,New York,182901.99
4,1,0,142107.34,91391.77,366168.42,Florida,166187.94

In [45]:
# But we still have state coloumn so we need to drop that 
# Whether to drop label from index i.e 0 or from coloumn i.e 1 (0 is the default value)
# If False, return a copy. Otherwise, do operation inplace and return None. by default false

df.drop('State',axis=1,inplace=True)

In [46]:
df.head()

   Florida  New York  R&D Spend  Administration  Marketing Spend     Profit
0        0         1  165349.20       136897.80        471784.10  192261.83
1        0         0  162597.70       151377.59        443898.53  191792.06
2        1         0  153441.51       101145.55        407934.54  191050.39
3        0         1  144372.41       118671.85        383199.62  182901.99
4        1         0  142107.34        91391.77        366168.42  166187.94

In [47]:
X=df.iloc[:,:-1]  # All the rows and all coloumn expect profit 
y=df.iloc[:,[5]]  # All the rows and last coloumn

In [49]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25)

In [50]:
from sklearn.linear_model import LinearRegression
regression=LinearRegression()
regression.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [51]:
y_pred=regression.predict(X_test)

In [52]:
from sklearn.metrics import r2_score
score=r2_score(y_test,y_pred)

In [53]:
score

0.9153751468870859